tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "boz/repo"

# Essentials
brew "zsh"
brew "zplug"
brew "tmux"
brew "neovim"
brew "fasd"
brew "fzf"
cask "font-source-code-pro"

# Cloud
brew "awscli"
cask "google-cloud-sdk"

# Hashicorp
brew "terraform"
brew "vault"

# Kubernetes tools
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "kops"
brew "kail"

# Dev tools
brew "git"
brew "git-crypt"
brew "tig"
brew "diff-so-fancy"
brew "go"
brew "dep"
brew "rustup"
brew "python3"
brew "python2"
brew "jsonnet"
cask "java8"
cask "node"
brew "bazel"
brew "ag"
brew "jq"

# Gnu / terminal tools
brew "coreutils"
brew "colordiff"
brew "gnu-sed"
brew "gnu-tar"
brew "tree"
brew "direnv"
brew "gnupg"
brew "lastpass-cli"
cask "keybase"

# System/ Network tools
brew "wget"
brew "htop"
brew "openvpn"
brew "openconnect"
