tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/cask"
#tap "caskroom/versions"
tap "boz/repo"

# Essentials
brew "zsh"
brew "zplug"
brew "tmux"
brew "neovim"
brew "fasd"
brew "fzf"
cask "karabiner-elements"
cask "alacritty"
brew "exa"

# Cloud
brew "awscli"
cask "google-cloud-sdk"

# Hashicorp
brew "terraform"
brew "packer"
brew "vault"

# Kubernetes tools
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "stern"
brew "kubectx"

# Dev tools
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "tig"
brew "diff-so-fancy"
brew "go"
brew "protobuf"
brew "dep"
brew "rustup"
brew "python3"
brew "python2"
brew "jsonnet"
cask "java"
brew "node"
brew "bazel"
brew "ag"
brew "ripgrep"
brew "jq"
cask "docker"

# Gnu / terminal tools
brew "coreutils"
brew "colordiff"
brew "gnu-sed"
brew "gnu-tar"
brew "tree"
brew "direnv"
brew "gnupg"
brew "lastpass-cli"
cask "keybase"

# System/ Network tools
brew "wget"
brew "htop"
brew "openvpn"
brew "openconnect"

# Other
cask "spotify"
cask "signal"
cask "steam"
